#include<iostream>
using namespace std;
void swap(int *a, int *b) {// a и b се пазят показателите на променливите на числата 1 и 2 т.е. къде в паметта са записани
/* Обобщение:
	 а == поинтърът на числото 1, (къде е записано числото)
	*а == самото число 1, (какво е записано на този адрес)
	&a == отново пойнтър само, че този път на а. (къде е записан нози адрес)
*/
	int c = *a; // Създавам нова променлива тип int, която да пази самата стойност а
	a = b; // Присвоявам пойнтърът на b в a. Така сега и а, и b сочят към едно и също място в паметта
	b = &c; // Присвоявам пойнтърът на c в b. Така сега b и &c имат една и съща стойност
}

int main() {
	int a = 1, b = 2;//Нашите числа
	swap(a, b);//Функцията, която трябва да ги размени
	cout << a << " " << b << endl;
}
