#include<iostream>
using namespace std;
// Тази задача не знам какво общо има с пойнтъри, но пък е добро упражнение за рекурсия.
void getElement(int n) {
	int element;//Новия елемент, които се въвежда
	cin >> element; //Въвеждаме го
	if(n == 1) {//Ако n == 1 => вече сме въвели елементите от n до 1 и този е бил последния => го извеждаме и се връщаме към мястото, от където е извикана функцията и продължаваме надолу
		cout << element << " ";
		return;
	}
	getElement(--n);//Тук викаме същата функция с --n => return-ът от ред 9 ще ни върне тук и продължаваме към ред 12.
	cout << element << " ";
}

int main() {
	int n;
	cin >> n;
	getElement(n);
	cout << endl;
}
